{
  "1.0.0": {
    "en": "First version!"
  },
  "1.0.6": {
    "en": "First publication"
  },
  "1.0.7": {
    "en": "Fixed crash in Account device caused by single digit day number for account rollover"
  },
  "1.0.8": {
    "en": "Undone hastily made fix"
  },
  "1.0.9": {
    "en": "Researched fix to enum key problem on month_day.period_start on account device"
  },
  "1.0.10": {
    "en": "Fix to crash caused by timeout obtaining data from Octopus Home Mini"
  },
  "1.0.11": {
    "en": "First attempted fix for Bug #2 missing tariff causes energyAccount to crash"
  },
  "1.0.12": {
    "en": "Attempt fix to Bug #4 - failure to set tomorrow's prices capability to true"
  },
  "1.0.13": {
    "en": "Calculation of projected bill (first attempt)"
  },
  "1.0.14": {
    "en": "Refresh account data every 30 minutes; energyAccount simplify calculation of period stand charge; improve commenting and remove redundant code"
  },
  "1.0.15": {
    "en": "Flexible capability addition/removal; device repair"
  },
  "1.0.16": {
    "en": "Dynamic capability sets on devices with modifiable capability options"
  },
  "1.0.17": {
    "en": "First simple integration of dispatches for intelligent tariffs"
  },
  "1.0.18": {
    "en": "Fix to Bug #7 devices not being updated"
  },
  "1.0.19": {
    "en": "Attempted fix of Bug #7 and its follow-on"
  },
  "1.0.21": {
    "en": "Rollback to 1.0.16 code base. Make changes to support single slot tariffs such as Octopus Tracker. Re-add the device count capability to verify ability to access Device and Dispatch data for Intelligent Tariffs."
  },
  "1.0.22": {
    "en": "Fix minor typo"
  },
  "1.0.23": {
    "en": "Harden code to access live meter reading data; filter devices to those that have Smart Control In Progress; remove excess logging"
  },
  "1.0.24": {
    "en": "Dispatch count capability on productTariff device to demonstrate correct access to flexPlannedDispatch data; tidy up logging."
  },
  "1.0.25": {
    "en": "Point release to broaden the selection of Intelligent Devices based on Device Status Codes"
  }
}
